<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-dev]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-dev]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-dev]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-dev]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-dev-20231115195101112400000001]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-dev-20231113184635539100000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635588900000003]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635579200000002]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=ga9l41p0v9]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=vfm4jx]
module.api_app.aws_api_gateway_method.get_daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-vfm4jx-GET]
module.api_app.aws_api_gateway_method.opt_daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-vfm4jx-OPTIONS]
module.api_app.aws_api_gateway_integration.get_daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-vfm4jx-GET]
module.api_app.aws_api_gateway_method_response.opt_daily_coffee: Refreshing state... [id=agmr-jfrfryrkn3-vfm4jx-OPTIONS-200]
module.api_app.aws_api_gateway_integration.opt_daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-vfm4jx-OPTIONS]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=skyh3v]
module.api_app.aws_api_gateway_integration_response.opt_daily_coffee: Refreshing state... [id=agir-jfrfryrkn3-vfm4jx-OPTIONS-200]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-jfrfryrkn3-dev]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=42vl6e]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=ga9l41p0v9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api_app.aws_api_gateway_method.get_daily_coffee has been deleted
  - resource "aws_api_gateway_method" "get_daily_coffee" {
      - http_method          = "GET" -> null
        id                   = "agm-jfrfryrkn3-vfm4jx-GET"
      - resource_id          = "vfm4jx" -> null
        # (6 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_method.opt_daily_coffee has been deleted
  - resource "aws_api_gateway_method" "opt_daily_coffee" {
      - http_method          = "OPTIONS" -> null
        id                   = "agm-jfrfryrkn3-vfm4jx-OPTIONS"
      - resource_id          = "vfm4jx" -> null
        # (6 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_method_response.opt_daily_coffee has been deleted
  - resource "aws_api_gateway_method_response" "opt_daily_coffee" {
        id                  = "agmr-jfrfryrkn3-vfm4jx-OPTIONS-200"
      - status_code         = "200" -> null
        # (5 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_resource.daily_coffee has been deleted
  - resource "aws_api_gateway_resource" "daily_coffee" {
      - id          = "vfm4jx" -> null
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_integration.get_daily_coffee will be created
  + resource "aws_api_gateway_integration" "get_daily_coffee" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "jfrfryrkn3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-south-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-south-2:057149530255:function:daily_coffee-dev/invocations"
    }

  # module.api_app.aws_api_gateway_integration.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration" "opt_daily_coffee" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "jfrfryrkn3"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api_app.aws_api_gateway_integration_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "jfrfryrkn3"
      + status_code         = "200"
    }

  # module.api_app.aws_api_gateway_method.get_daily_coffee will be created
  + resource "aws_api_gateway_method" "get_daily_coffee" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "jfrfryrkn3"
    }

  # module.api_app.aws_api_gateway_method.opt_daily_coffee will be created
  + resource "aws_api_gateway_method" "opt_daily_coffee" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "jfrfryrkn3"
    }

  # module.api_app.aws_api_gateway_method_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_method_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "jfrfryrkn3"
      + status_code         = "200"
    }

  # module.api_app.aws_api_gateway_resource.daily_coffee will be created
  + resource "aws_api_gateway_resource" "daily_coffee" {
      + id          = (known after apply)
      + parent_id   = "sogf0r"
      + path        = (known after apply)
      + path_part   = "daily-coffee"
      + rest_api_id = "jfrfryrkn3"
    }

  # module.api_app.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "w8ux6v" -> "skyh3v"
        id                    = "ags-jfrfryrkn3-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`